Revit 2026 API

# EffectInstanceSetDiffuseColor Method

---

Sets the diffuse color parameter of the effect instance.

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetDiffuseColor(
	Color color
)
```
```vb
Public Sub SetDiffuseColor (
	color As Color
)
```
```cpp
public:
void SetDiffuseColor(
	Color^ color
)
```
```fsharp
member SetDiffuseColor :
        color : Color -> unit
```

#### Parameters

color Color
     The diffuse color value.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

EffectInstance Class

Autodesk.Revit.DB.DirectContext3D Namespace